{
  "Characters": [
    {
      "id": 1,
      "name": "Vegeta",
      "bio": "Regal, egotistical, and full of pride, Vegeta was once a ruthless, cold-blooded warrior and outright killer, but later abandons his role in the Frieza Force, instead opting to remain and live on Earth. He would later repeatedly fight alongside Universe 7's most powerful warriors in order to protect Earth and his family, as well as to surpass Goku in power.",
      "stats": "",
      "image": "https://i.etsystatic.com/21725066/c/2121/2121/0/879/il/096b9c/2387787538/il_300x300.2387787538_8yvv.jpg",
      "Goal": " Become Strongest sayain ",
      "videoUrl":"https://www.youtube.com/embed/qKXXygauOhg",
      "origin": "Planet Vegeta"
    },
    {
      "id": 2,
      "name": "Eren Jaeger",
      "bio": "Eren was born and raised in Shiganshina District, which is located on the southern edge of Wall Maria. He lived there until the year 845, when the Colossal and Armored Titans breached the Wall, allowing a flood of Titans to invade and destroy the city. During the incident, Eren witnessed his mother being murdered and eaten by a smiling Titan. This event aroused in Eren an intense hatred towards the Titans, and he swore to wipe all of them off the face of the earth.",
      "stats": "",
      "image": "https://64.media.tumblr.com/4ec6f7a83250549d9e72770391c40dc1/45e4b45717d9be0a-62/s400x600/46a4a62a73a984956dfb950a728ed8b0e86bbd70.jpg",
      "Goal": "Freedom!!!!",
      "videoUrl": "https://www.youtube.com/embed/0mmIPNQN950",
      "origin": "Southern region of Wall Maria "
    },
    {
      "id": 3,
      "name": "Monkey D. Luffy",
      "bio": "Born in Foosha Village, Luffy is the son of Monkey D. Dragon, the leader of the Revolutionary Army,and the grandson of the Marine hero Monkey D. Garp,and their family carries the initial and Will of D.Luffy met Red-Haired Shanks, who gave Luffy the very straw hat that has become Luffy's signature accessory, having gifted it to the boy as part of a promise for them to meet again someday after he became a great pirate. Growing up on Dawn Island, Luffy befriended and became sworn brothers of the late Fire Fist Portgas D. Ace and Revolutionary Chief-of-Staff Sabo, as well as being raised under the care of Curly Dadan.",
      "stats": "",
      "image": "https://i.pinimg.com/564x/6a/96/5c/6a965c485e0ec662d8c849896ba6d59d.jpg",
      "Goal": "To Become The Pirate King",
      "videoUrl": "https://www.youtube.com/embed/HpinxWLsSyo",
      "origin": ""
    },
    {
      "id": 4,
      "name": "Saitama",
      "bio": "Due to his great power and being virtually indestructible, Saitama is an indifferent person. Even the mightiest foes pose no challenge to him, so he does not take his hero work seriously, goes through everything with little to no effort, and yearns for an opponent that can provide him with a challenge.The lack of worthy opponents has led him to suffer from a self-imposed existential crisis, and he claims that his ability to feel any emotions has dulled considerably.The combination of his attitude, unstoppable power, and unimpressive appearance often causes his battles to become anticlimactic. Saitama will usually allow his opponents to rant about their motives and power up into their strongest forms, before obliterating them with a single punch.",
      "stats": "",
      "image": "https://resizing.flixster.com/uCnT1IqDoxuBeuNuuiy2Yn3IAGk=/300x300/v2/https://flxt.tmsimg.com/assets/p13132769_i_v9_aa.jpg",
      "Goal": "Become Strongest Hero ",
      "videoUrl": "https://www.youtube.com/embed/0FV8YVOvD-c",
      "origin": " Hails From Z-City"
    },
    {
      "id": 5,
      "name": "Kyojuro Rengoku ",
      "bio": "Kyojuro was one of the nine Hashira, a group of the nine greatest Demon Slayers in the Demon Slayer Corps. Specifically, Kyojuro was the Flame Hashira who made use of the Flame Breathing. While not having his life being directly affected by Demons like many other members in the Corps, Kyojuro household had produced Demon hunters for generations. Kyojuro, with his sense of duty instilled by his ailing mother since childhood, saw it as a duty to protect the innocent from Demons and entered the corps to serve humanity.",
      "stats": "",
      "image": "https://cdn.vox-cdn.com/thumbor/BHxry5lIWKDN2lIAkIc_AP7Zy10=/1400x1400/filters:format(jpeg)/cdn.vox-cdn.com/uploads/chorus_asset/file/19889060/demon_slayer_infinity_train_1.jpg",
      "Goal": "Annihilate the Demon race ",
      "videoUrl": "https://www.youtube.com/embed/OezGq8X-h8Y",
      "origin": "Sakurashinmachi in Setagaya,"
    },
    {
      "id": 6,
      "name": "Naruto Uzumaki ",
      "bio": "Naruto is a boisterous and exuberant boy. He would end sentences with Dattebayo! When excited or frustrated. He has a number of childish traits, such as being a very picky eater (he almost exclusively eats ramen), being afraid of ghosts, and carries a chubby green-frog wallet which he calls Gama-chan. Naruto is heedless to formality or social standings and has a habit of giving people he meets nicknames or addressing them without appropriate honourifics, as shown when he opted to call the Second Hokage a name he thought of off the top of his head instead of simply Lord Second (二代目様, Nidaime-sama).",
      "stats": "",
      "image": "https://64.media.tumblr.com/2043bec23a612368b86dd8dac74f5b5e/f44524266fde4b9e-5c/s400x600/995ef8def5dbc7e36a64e85f3dd50a7878bab62b.jpg",
      "Goal": "Becomes A Shinobi With Goal To Be The Hokage Of The Village. ",
      "videoUrl":"https://www.youtube.com/embed/ejWo1KHRYTI" ,
      "origin": " Konohagakure (Hidden Leaf Village)"
    },
  
    {
      "id": 7,
      "name": "Frieza",
      "bio": "Considered Goku's greatest foe and archnemesis, he has made several comebacks since his fight with Goku on Namek, including multiple invasions of Earth. Recently, he was chosen to represent Universe 7 as the tenth member of Team Universe 7 for the Tournament of Power as a replacement for Good Buu. This makes him the most recurring villain of the Dragon Ball series.",
      "stats": "",
      "image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/84dc13b7-a2e7-4b45-83ec-311e72e82900/ddmfq1z-6115ca82-9d1d-454d-8f7c-292f8771dd28.png/v1/fit/w_300,h_640,strp/golden_frieza_card_2__bucchigiri_match__by_maxiuchiha22_ddmfq1z-300w.png?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9NjQwIiwicGF0aCI6IlwvZlwvODRkYzEzYjctYTJlNy00YjQ1LTgzZWMtMzExZTcyZTgyOTAwXC9kZG1mcTF6LTYxMTVjYTgyLTlkMWQtNDU0ZC04ZjdjLTI5MmY4NzcxZGQyOC5wbmciLCJ3aWR0aCI6Ijw9NjQwIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmltYWdlLm9wZXJhdGlvbnMiXX0.x53btFiiwsUfp3Jnk7MDJyae7GzYB6gM3-TIzerUl-I",
      "Goal": "He does not want to be immortal, he does not want to become invincible, he wants to become taller! ",
      "videoUrl": "https://www.youtube.com/embed/sjO4O8ngqag",
      "origin": "Unknown "
    },
    {
      "id": 8,
      "name": "Garou",
      "bio": "Garou is a villain, a martial arts prodigy, the self-proclaimed Hero Hunter, and a major adversary of the Hero Association and Monster Association. He is a disciple of Bang and was once expelled from his dojo for going on a rampage. Because of his fascination with monsters, he is commonly called the Human Monster. Sitch of the Hero Association views him as a grave threat to the organization despite being only a human.",
      "stats": "",
      "image": "https://staticc.sportskeeda.com/editor/2022/05/8f5d0-16524306209369-1920.jpg",
      "Goal": "he simply wishes to beat up heroes in a punishing fashion",
      "videoUrl": "https://www.youtube.com/embed/Je0IKUhbp18",
      "origin": "S-City"
    },
    {
      "id": 9,
      "name": "Reiner Braun",
      "bio": "Reiner Braun is the Vice Captain of the Warrior Unit and the main protagonist of Attack on Titan from the Marleyan perspective. He is the illegitimate son of an Eldian and a Marleyan and grew up in Liberio's internment zone. Eventually, he was selected as a child to become one of Marley's Warriors. At the age of ten, he inherited the power of the Armored Titan. In the year 845, he infiltrated Paradis Island alongside Bertolt Hoover, Annie Leonhart, and Marcel Galliard as part of an operation to reclaim the Founding Titan.",
      "stats": "",
      "image": "https://sportshub.cbsistatic.com/i/2022/03/26/68737b81-af8c-48ad-920a-ed7420f15d34/attack-on-titan.jpg",
      "Goal": "Wanted to be a Hero",
      "videoUrl": "https://www.youtube.com/embed/BhB-ZsO1A1Q" ,
      "origin": "Liberio"
    },
    {
      "id": 10,
      "name": "Donquixote Doflamingo ",
      "bio": "Donquixote Doflamingo, nicknamed Heavenly Yaksha, is the captain of the Donquixote Pirates. Prior to his imprisonment, he was a member of the Seven Warlords of the Sea with a frozen bounty of Beli.pn340,000,000, as well as the most influential underworld broker under the codename Joker. He is also a former World Noble, descended from the Donquixote Family. He is the first son of the late Donquixote Homing and the older brother of the late Rosinante,both of whom he killed out of feeling betrayed by them. Doflamingo became the King of Dressrosa after taking the throne from Riku Doldo III eight years before the start of the series.He ruled the country tyrannically. He is a major antagonist in the Marineford Arc where he took part in the Summit War of Marineford and sided with the Marines, along with most of the other Warlords of the Sea, and the primary antagonist of the Dressrosa Arc and the Dressrosa Saga as a whole, being the impetus for the entirety of the saga's events.",
      "stats": "",
      "image": "https://i.pinimg.com/736x/ea/ec/3c/eaec3c6417db4eb53ac0beafc9a7051b.jpg",
      "Goal": "A new world in which only the strong survive",
      "videoUrl":"https://www.youtube.com/embed/Nyy_nreMuVE",
      "origin": "Minion Island is an island in North Blue"
    },
    {
      "id": 11,
      "name": "Pain",
      "bio": "Nagato was a shinobi of Amegakure and descendant of the Uzumaki clan. Forming Akatsuki alongside his friends (and fellow war orphans) Yahiko and Konan, Nagato dreamed of bringing peace to the violent shinobi world. However, following Yahiko's death, Nagato adopted the alias of Pain and, along with Konan, began leading a new Akatsuki — one that would force the world into peace using any means necessary",
      "stats": "",
      "image": "https://wallpaper.dog/large/984345.jpg",
      "Goal": "Bringing peace to the violent shinobi world.",
      "videoUrl": "https://www.youtube.com/embed/Hd8Dh7QmGT8",
      "origin": "Konohagakure (Hidden Leaf Village)"
    },
    {
      "id": 12,
      "name": "Muzan Kibutsuji",
      "bio": "Muzan Kibutsuji is the main antagonist of Demon Slayer: Kimetsu no Yaiba. He is the Demon King, the first of his kind, and the progenitor of all other demons in existence. [8] Muzan is also the leader of the Twelve Kizuki, an organization of the twelve strongest demons in existence that serve directly under him. A millennium ago, during the Heian Era, Muzan was turned into a demon during an experimental treatment trying to cure his terminal illness,and his goal since then was to live without the fear of death and become truly eternal.He plans to accomplish this in 2 ways: finding the Blue Spider Lily or creating more demons in hopes that one day one would be able to conquer their weakness of sunlight.",
      "stats": "",
      "image": "https://m.media-amazon.com/images/M/MV5BMzcyZjYxYzktMWZhMi00ZGFkLTllMTEtNjJjZjU4ODdlYzRmXkEyXkFqcGdeQXVyNjAwNDUxODI@._V1_.jpg",
      "Goal": "Live without the fear of death and become truly eternal.",
      "videoUrl":"https://www.youtube.com/embed/X5yD2jqO0Bc" ,
      "origin": " Japan's Heian era,"
    }
  
  ]
}